Билет_5/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет_5/src/CalculationRegisters/ДополнительныеНачисления/ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Билет_5/src/CalculationRegisters/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.ЗначениеЧасов</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Билет_5/src/InformationRegisters/СведенияОСотрудниках/СведенияОСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОСотрудниках</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерхняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Билет_5/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумама</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммарный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Билет_5/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.01</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.02</code>
      </childItems>
      <childItems>
        <name>ТоварыВПути</name>
        <description>Товары в пути</description>
        <code>01.03</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.04</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ОсновноеПроизводство</name>
        <description>Основное производство</description>
        <code>01.05</code>
      </childItems>
      <childItems>
        <name>ОбщехозяйственныеЗатраты</name>
        <description>Общехозяйственные затраты</description>
        <code>01.06</code>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыВыданные</name>
        <description>Кредиты и займы выданные</description>
        <code>01.07</code>
      </childItems>
      <childItems>
        <name>Материалы</name>
        <description>Материалы</description>
        <code>01.08</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>02.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыПолученные</name>
        <description>Кредиты и займы полученные</description>
        <code>02.03</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Налоги</name>
        <description>Налоги</description>
        <code>02.04</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Агенты</name>
        <description>Агенты</description>
        <code>02.05</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ПрибылиУбытки</name>
      <description>Прибыли убытки</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммарный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Билет_5/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
  </type>
  <predefined>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>ИнвНомер</name>
      <description>Инв номер</description>
      <code>000000002</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Билет_5/src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Штраф</name>
      <description>Штраф</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

Билет_5/src/Documents/НачислениеЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаДополнительныеНачисления Из ДополнительныеНачисления Цикл
		Движение = Движения.ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаДополнительныеНачисления.ВидРасчета;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисления.Сотрудник;
		Движение.Подразделение = ТекСтрокаДополнительныеНачисления.Подразделение;
		Движение.Процент = ТекСтрокаДополнительныеНачисления.Процент;
	КонецЦикла;

	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
		Движение.Размер = ТекСтрокаОсновныеНачисления.Размер;
	КонецЦикла;
	Движения.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.Подразделение КАК Подразделение,
	|	ОсновныеНачисленияДанныеГрафика.ЗначениеЧасовПериодДействия КАК Норма,
	|	ОсновныеНачисленияДанныеГрафика.ЗначениеЧасовФактическийПериодДействия КАК Отработано
	|ПОМЕСТИТЬ ВремТ
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(ВидРасчета = &Оклад
	|	И Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОСотрудникахСрезПоследних.Подразделение КАК Подразделение,
	|	СведенияОСотрудникахСрезПоследних.ВерхняяГраница КАК ВерхняяГраница,
	|	СведенияОСотрудникахСрезПоследних.Оклад КАК Оклад
	|ПОМЕСТИТЬ ВремТ2
	|ИЗ
	|	РегистрСведений.СведенияОСотрудниках.СрезПоследних(&Дата, Подразделение В
	|		(ВЫБРАТЬ
	|			ВремТ.Подразделение КАК Подразделение
	|		ИЗ
	|			ВремТ КАК ВремТ)) КАК СведенияОСотрудникахСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТ2.Подразделение КАК Подразделение,
	|	ВремТ2.ВерхняяГраница КАК ВерхняяГраница,
	|	ЕСТЬNULL(ВремТ21.ВерхняяГраница, 0) КАК НижняяГраница,
	|	МАКСИМУМ(ВремТ2.Оклад) КАК Оклад
	|ПОМЕСТИТЬ ВремТ3
	|ИЗ
	|	ВремТ2 КАК ВремТ2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТ2 КАК ВремТ21
	|		ПО ВремТ2.Подразделение = ВремТ21.Подразделение
	|		И ВремТ2.ВерхняяГраница > ВремТ21.ВерхняяГраница
	|СГРУППИРОВАТЬ ПО
	|	ВремТ2.Подразделение,
	|	ВремТ2.ВерхняяГраница,
	|	ЕСТЬNULL(ВремТ21.ВерхняяГраница, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТ.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВремТ.Норма, 0) КАК Норма,
	|	ЕСТЬNULL(ВремТ.Отработано, 0) КАК Отработано,
	|	ЕСТЬNULL(Минимум(ВремТ3.Оклад), 0) КАК Оклад
	|ИЗ
	|	ВремТ КАК ВремТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТ3 КАК ВремТ3
	|		ПО ВремТ.Подразделение = ВремТ3.Подразделение
	|		И ВремТ.Отработано МЕЖДУ ВремТ3.НижняяГраница И ВремТ3.ВерхняяГраница
	|СГРУППИРОВАТЬ ПО
	|	ВремТ.НомерСтроки,
	|	ВремТ.Норма,
	|	ВремТ.Отработано,
	|	ЕСТЬNULL(ВремТ.Норма, 0),
	|	ЕСТЬNULL(ВремТ.Отработано, 0)";

	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка= РезультатЗапроса.Выбрать();
	
	Для Каждого СтрокаДвижения из Движения.ОсновныеНачисления Цикл
		Если СтрокаДвижения.ВидРасчета <> 	ПланыВидовРасчета.ОсновныеНачисления.Оклад тогда
			продолжить;
		КонецЕсли;
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаДвижения.НомерСтроки,"НомерСтроки");
		СтрокаДвижения.Результат = Выборка.Оклад/ Выборка.Норма* Выборка.Отработано;	
		СтрокаДвижения.Размер = Выборка.Оклад;
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки,
		|	ОсновныеНачисленияДанныеГрафика.Значение15МинФактическийПериодДействия
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
		|	И ВидРасчета = &Штраф) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Штраф", ПланыВидовРасчета.ОсновныеНачисления.Штраф);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Для Каждого СтрокаДвижения из Движения.ОсновныеНачисления Цикл
		Если СтрокаДвижения.ВидРасчета <> 	ПланыВидовРасчета.ОсновныеНачисления.Штраф тогда
			продолжить;
		КонецЕсли;
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаДвижения.НомерСтроки,"НомерСтроки");
		СтрокаДвижения.Результат = Выборка.Значение15МинФактическийПериодДействия*СтрокаДвижения.Размер;	
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Подразделение,
		|	ДополнительныеНачисления.НомерСтроки
		|ПОМЕСТИТЬ ВремТ
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
		|ГДЕ
		|	ДополнительныеНачисления.Регистратор = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(УправленческийОборотыДтКт.СумамаОборотДт) КАК СумамаОборотДт,
		|	УправленческийОборотыДтКт.СубконтоКт3
		|ПОМЕСТИТЬ ВремТ1
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.ОборотыДтКт(&НМ, &КМ,, СчетДт = &Покупатели,, СчетКт = &ПрибылиУбытки, &СубконтоУ,
		|		СубконтоКт3 В
		|		(ВЫБРАТЬ
		|			ВремТ.Подразделение
		|		ИЗ
		|			ВремТ КАК ВремТ)) КАК УправленческийОборотыДтКт
		|СГРУППИРОВАТЬ ПО
		|	УправленческийОборотыДтКт.СубконтоКт3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремТ.НомерСтроки,
		|	ЕстьNull(ВремТ1.СумамаОборотДт,0) как СумамаОборотДт
		|ИЗ
		|	ВремТ КАК ВремТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТ1 КАК ВремТ1
		|		ПО ВремТ.Подразделение = ВремТ1.СубконтоКт3";
	СубконтоУ = новый Массив;
	СубконтоУ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	СубконтоУ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ИнвНомер);
	СубконтоУ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Подразделение);
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("СубконтоУ", СубконтоУ);
	Запрос.УстановитьПараметр("КМ", КонецМесяца(ДобавитьМесяц(Дата,-1)));
	Запрос.УстановитьПараметр("ПрибылиУбытки", ПланыСчетов.Управленческий.ПрибылиУбытки);
	Запрос.УстановитьПараметр("Покупатели", ПланыСчетов.Управленческий.Покупатели);
	Запрос.УстановитьПараметр("НМ", НачалоМесяца(ДобавитьМесяц(Дата,-1)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Для Каждого СтрокаДвижения из Движения.ДополнительныеНачисления Цикл	
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаДвижения.НомерСтроки,"НомерСтроки");
		СтрокаДвижения.Результат = ?(Выборка.СумамаОборотДт=0,0,Выборка.СумамаОборотДт*СтрокаДвижения.Процент/100);	
	КонецЦикла;
	Движения.ДополнительныеНачисления.Записать();
	
КонецПроцедуры
